emacs/emacs.org

Emacs config. This would go into ~/.config/emacs/init.el

#+PROPERTY: header-args :tangle init.el

* Package setup

[[https://github.com/jwiegley/use-package][use-package]] helps in the configuration and loading of packages

#+begin_src emacs-lisp
  ;; Set up package.el to work with MELPA
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Initialize use-package
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src

* UI stuff

#+begin_src emacs-lisp
  ;; UTF-8 support
  (prefer-coding-system       'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)

  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

  ;; font
  (set-face-attribute 'default nil
                      :font "DejaVu Sans Mono"
                      :height 110)

  ;; theme
  (use-package doom-themes
    :init (load-theme 'doom-one t))

  ;; Don't show the splash screen
  (setq inhibit-startup-message t)

  ;; Turn off some unneeded UI elements
  (menu-bar-mode -1)
  (tool-bar-mode -1)

  (when (display-graphic-p)
    (scroll-bar-mode -1))

  (column-number-mode)
  (global-hl-line-mode +1)
  (global-display-line-numbers-mode t)

  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  ;; Show matching parens
  (show-paren-mode 1)

  ;; word wrap
  (global-visual-line-mode 1)
#+end_src

* Misc

#+begin_src emacs-lisp
  ;; no auto save
  (setq auto-save-default nil)

  ;; no pesky lock files
  (setq create-lockfiles nil)

  ;; save place in files
  (save-place-mode 1)
#+end_src

* Evil mode

#+begin_src emacs-lisp
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+end_src

* Org Mode

#+begin_src emacs-lisp
  (use-package org
    :config
    (setq org-startup-indented t)
    (setq org-startup-folded t)
    (setq org-hide-emphasis-markers t)
    (setq org-startup-with-inline-images t)

    (setq org-todo-keywords
          '((sequence "TODO(t)" "PROG(p)" "HOLD(h)" "|" "DONE(d)")))

    (setq org-todo-keyword-faces
          '(("TODO" . "light blue") ("PROG" . "yellow")))

    (setq org-link-frame-setup
          '((vm . vm-visit-folder-other-frame)
            (vm-imap . vm-visit-imap-folder-other-frame)
            (gnus . org-gnus-no-new-news)
            (file . find-file)
            (wl . wl-other-frame))))
#+end_src

* org hide emphasis markers
#+begin_src emacs-lisp
  (use-package org-appear
    :hook (org-mode . org-appear-mode))
#+end_src

* Org agenda

#+begin_src emacs-lisp
  (setq org-agenda-files '("~/Dropbox/notes"
                           "/z/apps/synapse/README.org"
                           "~/Dropbox/work/booknow/README.org"))
  ;; Ibuffer
  (global-set-key (kbd "C-x a") 'org-agenda)
#+end_src

* Org roam

#+begin_src emacs-lisp
  (use-package org-roam
    :ensure t
    :custom
    (org-roam-directory "~/Dropbox/roam")
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n i" . org-roam-node-insert))
    :config
    (org-roam-setup))
#+end_src

* Org babel

#+begin_src emacs-lisp
  (setq org-confirm-babel-evaluate nil)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t)
     (perl . t)
     (js . t)))
#+end_src

* Which key

[[https://github.com/justbur/emacs-which-key][which-key]] is a useful extension which displays available keybindings in a popup.

#+begin_src emacs-lisp
  (use-package which-key
    :config
    (which-key-mode))
#+end_src

* Commenting code

#+begin_src emacs-lisp
  ;; gcc Comment a line
  ;; gc Comment a visual block
  (use-package evil-commentary
    :config
    (evil-commentary-mode))
#+end_src

* ibuffer

#+begin_src emacs-lisp
  ;; Ibuffer
  (global-set-key (kbd "C-x C-b") 'ibuffer)
#+end_src

* Magit

#+begin_src emacs-lisp
  (use-package magit
    :ensure t
    :bind ("C-x g" . magit-status))
#+end_src

* Completion

#+begin_src emacs-lisp
  ;; Ido mode
  (setq ido-enable-flex-matching t)
  (setq ido-everywhere t)
  (ido-mode 1)

  (use-package ivy
    :init
    (ivy-mode 1)
    :config
    (setq ivy-use-virtual-buffers t)
    (setq ivy-wrap t)
    (setq ivy-count-format "(%d/%d) ")
    (setq enable-recursive-minibuffers t))

  (use-package company
    ;; Navigate in completion minibuffer with `C-n` and `C-p`.
    :bind (:map company-active-map
                ("C-n" . company-select-next)
                ("C-p" . company-select-previous))
    :commands company-mode
    :init
    (add-hook 'prog-mode-hook #'company-mode)
    (add-hook 'text-mode-hook #'company-mode))
#+end_src

* Treemacs

#+begin_src emacs-lisp
  (use-package treemacs
    :custom
    (treemacs--icon-size 16)
    :bind ("C-c t" . treemacs-select-window))
  (use-package treemacs-evil)
#+end_src

* Calc

#+begin_src emacs-lisp
  (global-set-key (kbd "C-x c") 'quick-calc)
#+end_src

* web mode

#+begin_src emacs-lisp
  (use-package web-mode
    :mode ("\\.html?\\'"
           "\\.svelte\\'"
           "\\.js\\'")
    :config
    (setq-default web-mode-code-indent-offset 2)
    (setq-default web-mode-markup-indent-offset 2)
    (setq-default web-mode-attribute-indent-offset 2))

  (setq js-indent-level 2)
#+end_src

* docker

#+begin_src emacs-lisp
  (use-package dockerfile-mode)
#+end_src

* Markdown

#+begin_src emacs-lisp
  (use-package markdown-mode
    :ensure t
    :init (setq markdown-command "multimarkdown"))
#+end_src

* YAML

#+begin_src emacs-lisp
  (use-package yaml-mode)
#+end_src

* quelpa

#+begin_src emacs-lisp
  (use-package quelpa)
  (use-package quelpa-use-package)
#+end_src

* copilot

#+begin_src emacs-lisp
  (use-package s)
  (use-package dash)
  (use-package editorconfig)
  (use-package company)

  (use-package copilot
    :quelpa (copilot :fetcher github
                     :repo "copilot-emacs/copilot.el"
                     :branch "main"
                     :files ("dist" "*.el"))
    :init
    (add-hook 'prog-mode-hook #'copilot-mode))
  ;; you can utilize :map :hook and :config to customize copilot

  (defun ra/no-copilot-mode ()
    "Helper for `ra/no-copilot-modes'."
    (copilot-mode -1))

  (defvar ra/no-copilot-modes '(shell-mode
                                inferior-python-mode
                                eshell-mode
                                term-mode
                                vterm-mode
                                comint-mode
                                compilation-mode
                                debugger-mode
                                dired-mode-hook
                                compilation-mode-hook
                                flutter-mode-hook
                                minibuffer-mode-hook)
    "Modes in which copilot is inconvenient.")

  (defun ra/copilot-disable-predicate ()
    "When copilot should not automatically show completions."
    (or ra/copilot-manual-mode
        (member major-mode ra/no-copilot-modes)
        (company--active-p)))

  (add-to-list 'copilot-disable-predicates #'ra/copilot-disable-predicate)

  (defvar ra/copilot-manual-mode nil
    "When `t' will only show completions when manually triggered, e.g. via M-C-<return>.")

  (defun ra/copilot-change-activation ()
    "Switch between three activation modes:
        - automatic: copilot will automatically overlay completions
        - manual: you need to press a key (M-C-<return>) to trigger completions
        - off: copilot is completely disabled."
    (interactive)
    (if (and copilot-mode ra/copilot-manual-mode)
        (progn
          (message "deactivating copilot")
          (global-copilot-mode -1)
          (setq ra/copilot-manual-mode nil))
      (if copilot-mode
          (progn
            (message "activating copilot manual mode")
            (setq ra/copilot-manual-mode t))
        (message "activating copilot mode")
        (global-copilot-mode))))

  (define-key global-map (kbd "M-C-<escape>") #'ra/copilot-change-activation)

  (defun ra/copilot-complete-or-accept ()
    "Command that either triggers a completion or accepts one if one
      is available. Useful if you tend to hammer your keys like I do."
    (interactive)
    (if (copilot--overlay-visible)
        (progn
          (copilot-accept-completion)
          (open-line 1)
          (next-line))
      (copilot-complete)))

  (define-key copilot-mode-map (kbd "M-C-<next>") #'copilot-next-completion)
  (define-key copilot-mode-map (kbd "M-C-<prior>") #'copilot-previous-completion)
  (define-key copilot-mode-map (kbd "M-C-<right>") #'copilot-accept-completion-by-word)
  (define-key copilot-mode-map (kbd "M-C-<down>") #'copilot-accept-completion-by-line)
  (define-key global-map (kbd "M-C-<return>") #'rk/copilot-complete-or-accept)

  (defun ra/copilot-tab ()
    "Tab command that will complet with copilot if a completion is
    available. Otherwise will try company, yasnippet or normal
    tab-indent."
    (interactive)
    (or (copilot-accept-completion)
        (company-yasnippet-or-completion)
        (indent-for-tab-command)))

  (define-key global-map (kbd "C-<tab>") #'ra/copilot-tab)

  (defun ra/copilot-quit ()
    "Run `copilot-clear-overlay' or `keyboard-quit'. If copilot is
  cleared, make sure the overlay doesn't come back too soon."
    (interactive)
    (condition-case err
        (when copilot--overlay
          (lexical-let ((pre-copilot-disable-predicates copilot-disable-predicates))
                       (setq copilot-disable-predicates (list (lambda () t)))
                       (copilot-clear-overlay)
                       (run-with-idle-timer
                        1.0
                        nil
                        (lambda ()
                          (setq copilot-disable-predicates pre-copilot-disable-predicates)))))
      (error handler)))

  (advice-add 'keyboard-quit :before #'ra/copilot-quit)
#+end_src
